## [ 교재 6장 : 텍스트 데이터 다루기 ]

In [81]:
# 6.1 대소문자 변환과 공백
# 시작하기
import pandas as pd
file1 = '../DATA/chicago_food_inspections.csv'
inspections = pd.read_csv(file1)
inspections

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

In [82]:
inspections['Name'].values  # 공백이 많다

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       ..., ' Cafe 608 ', "  mr.daniel's ", '   TEMPO CAFE '],
      dtype=object)

In [83]:
# .str.rstrip   .lstrip   .strip  : 좌. 우, 양측 공백 제거
inspections['Name'].str.lstrip().values, inspections['Name'].str.rstrip().values, inspections['Name'].str.strip().values

(array(['MARRIOT MARQUIS CHICAGO   ', 'JETS PIZZA ', 'ROOM 1520 ', ...,
        'Cafe 608 ', "mr.daniel's ", 'TEMPO CAFE '], dtype=object),
 array([' MARRIOT MARQUIS CHICAGO', ' JETS PIZZA', '   ROOM 1520', ...,
        ' Cafe 608', "  mr.daniel's", '   TEMPO CAFE'], dtype=object),
 array(['MARRIOT MARQUIS CHICAGO', 'JETS PIZZA', 'ROOM 1520', ...,
        'Cafe 608', "mr.daniel's", 'TEMPO CAFE'], dtype=object))

In [84]:
inspections['Name'] = inspections['Name'].str.strip()
inspections['Name'] = inspections['Name'].str.lower()

In [85]:
for col in inspections.columns:
    inspections[col] = inspections[col].str.capitalize()
inspections

                                Name             Risk
0            Marriot marquis chicago    Risk 1 (high)
1                         Jets pizza  Risk 2 (medium)
2                          Room 1520     Risk 3 (low)
3            Marriot marquis chicago    Risk 1 (high)
4                         Chartwells    Risk 1 (high)
...                              ...              ...
153805                     Wolcott's    Risk 1 (high)
153806  Dunkin donuts/baskin-robbins  Risk 2 (medium)
153807                      Cafe 608    Risk 1 (high)
153808                   Mr.daniel's    Risk 1 (high)
153809                    Tempo cafe    Risk 1 (high)

[153810 rows x 2 columns]

In [86]:
# title() : 각 단어 첫 글자 대문자화
for col in inspections.columns:
    inspections[col] = inspections[col].str.title()
inspections

                                Name             Risk
0            Marriot Marquis Chicago    Risk 1 (High)
1                         Jets Pizza  Risk 2 (Medium)
2                          Room 1520     Risk 3 (Low)
3            Marriot Marquis Chicago    Risk 1 (High)
4                         Chartwells    Risk 1 (High)
...                              ...              ...
153805                     Wolcott'S    Risk 1 (High)
153806  Dunkin Donuts/Baskin-Robbins  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   Mr.Daniel'S    Risk 1 (High)
153809                    Tempo Cafe    Risk 1 (High)

[153810 rows x 2 columns]

In [87]:
# 6.2 문자열 슬라이싱 : 동일한 자리(문자 인덱스)에 있는 글자를 모아보고 싶다
# 1) 확인
inspections['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
      dtype=object)

In [88]:
# 2) 결측치 제거
# inspections['Risk'].dropna()  => 이러면 전체 반영할 수 없다~
inspections = inspections.dropna(subset=['Risk'])

# 3) all -> Risk 4
inspections.Risk = inspections.Risk.str.replace('All', 'Risk 4 (Extreme)')
inspections.Risk.unique()

C:\Users\wjs31\AppData\Local\Temp\ipykernel_20752\1823777432.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inspections.Risk = inspections.Risk.str.replace('All', 'Risk 4 (Extreme)')

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (Extreme)'], dtype=object)

In [89]:
# 6.3 문자열 슬라이싱과 문자 치환
# 위에서 정리한 Risk에서 숫자만 가져오자

inspections.Risk.str.slice(5,6)
inspections.Risk.str[5:6]   # same results

0         1
1         2
2         3
3         1
4         1
         ..
153805    1
153806    2
153807    1
153808    1
153809    1
Name: Risk, Length: 153744, dtype: object

In [90]:
# slice(start , stop) : 인덱스 start에서부터 stop 까지 출력
inspections.Risk.str.slice(8)
inspections.Risk.str[8:]

0           High)
1         Medium)
2            Low)
3           High)
4           High)
           ...
153805      High)
153806    Medium)
153807      High)
153808      High)
153809      High)
Name: Risk, Length: 153744, dtype: object

In [91]:
# 마지막 인덱스 제거
inspections.Risk.str.slice(8, -1)
inspections.Risk.str[8:-1]
inspections.Risk.str.slice(8).str.replace(")","")  # .str 은 매번 써야한다

0           High
1         Medium
2            Low
3           High
4           High
           ...
153805      High
153806    Medium
153807      High
153808      High
153809      High
Name: Risk, Length: 153744, dtype: object

In [92]:
# 6.4 불리언 메서드
"Pizza" in "Mad Pizza"

True

In [93]:
# lower() 로 대소문자 다른 문제를 방지
inspections.Name.str.lower().str.contains("pizza")

0         False
1          True
2         False
3         False
4         False
          ...
153805    False
153806    False
153807    False
153808    False
153809    False
Name: Name, Length: 153744, dtype: bool

In [94]:
# pizza 포함 인덱스
inspections[ inspections.Name.str.lower().str.contains("pizza") ]

                                    Name             Risk
1                             Jets Pizza  Risk 2 (Medium)
19         Nancy'S Home Of Stuffed Pizza    Risk 1 (High)
27            Nary'S Grill & Pizza ,Inc.    Risk 1 (High)
29                   Narys Grill & Pizza    Risk 1 (High)
68                         Colutas Pizza    Risk 1 (High)
...                                  ...              ...
153756       Angelo'S Stuffed Pizza Corp    Risk 1 (High)
153764                Cochiaros Pizza #2    Risk 1 (High)
153772  Fernando'S Mexican Grill & Pizza    Risk 1 (High)
153788            Reggio'S Pizza Express    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3992 rows x 2 columns]

In [95]:
inspections[ inspections.Name.str.lower().str.startswith("tacos") ]

                         Name           Risk
69               Tacos Nietos  Risk 1 (High)
556       Tacos El Tio 2 Inc.  Risk 1 (High)
675          Tacos Don Gabino  Risk 1 (High)
958       Tacos El Tio 2 Inc.  Risk 1 (High)
1036      Tacos El Tio 2 Inc.  Risk 1 (High)
...                       ...            ...
143587          Tacos De Luna  Risk 1 (High)
144026           Tacos Garcia  Risk 1 (High)
146174        Tacos Place'S 1  Risk 1 (High)
147810  Tacos Mario'S Limited  Risk 1 (High)
151191            Tacos Reyna  Risk 1 (High)

[105 rows x 2 columns]

In [96]:
inspections[ inspections.Name.str.lower().str.endswith("tacos") ]

                   Name           Risk
382        Lazo'S Tacos  Risk 1 (High)
569        Lazo'S Tacos  Risk 1 (High)
2652       Flying Tacos   Risk 3 (Low)
3250       Jony'S Tacos  Risk 1 (High)
3812       Paco'S Tacos  Risk 1 (High)
...                 ...            ...
151121      Reyes Tacos  Risk 1 (High)
151318   El Macho Tacos  Risk 1 (High)
151801   El Macho Tacos  Risk 1 (High)
153087  Raymond'S Tacos  Risk 1 (High)
153504        Mis Tacos  Risk 1 (High)

[304 rows x 2 columns]

In [97]:
# 6.5 문자열 분할
customers = pd.read_csv("../DATA/customers.csv")
customers

                     Name                                            Address
0           Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1       Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2         Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3     Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4          Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...
...                   ...                                                ...
9956        Dana Browning  762 Andrew Views Apt. 254, North Paul, New Mex...
9957      Amanda Anderson  44188 Day Crest Apt. 901, Lake Marcia, Maine, ...
9958           Eric Davis  73015 Michelle Squares, Watsonville, West Virg...
9959     Taylor Hernandez       129 Keith Greens, Haleyfurt, Oklahoma, 98916
9960     Sherry Nicholson   355 Griffin Valley, Davidtown, New Mexico, 17581

[9961 rows x 2 columns]

In [98]:
customers.Name.str.len()

0       13
1       17
2       15
3       19
4       14
        ..
9956    13
9957    15
9958    10
9959    16
9960    16
Name: Name, Length: 9961, dtype: int64

In [99]:
# split( ) 의 사용
customers.Name.str.split(' ')
customers.Name.str.split(pat=' ')

0              [Frank, Manning]
1          [Elizabeth, Johnson]
2            [Donald, Stephens]
3       [Michael, Vincent, III]
4             [Jasmine, Zamora]
                 ...
9956           [Dana, Browning]
9957         [Amanda, Anderson]
9958              [Eric, Davis]
9959        [Taylor, Hernandez]
9960        [Sherry, Nicholson]
Name: Name, Length: 9961, dtype: object

In [100]:
# len() : 리스트의 길이 보기
customers.Name.str.split(' ').str.len()

0       2
1       2
2       2
3       3
4       2
       ..
9956    2
9957    2
9958    2
9959    2
9960    2
Name: Name, Length: 9961, dtype: int64

In [101]:
# split(pat= , n =) : n= 분할 개수 제한
customers.Name.str.split(' ', n=1)  # 모두 2개까지만 분할

0             [Frank, Manning]
1         [Elizabeth, Johnson]
2           [Donald, Stephens]
3       [Michael, Vincent III]
4            [Jasmine, Zamora]
                 ...
9956          [Dana, Browning]
9957        [Amanda, Anderson]
9958             [Eric, Davis]
9959       [Taylor, Hernandez]
9960       [Sherry, Nicholson]
Name: Name, Length: 9961, dtype: object

In [102]:
# str.get() : 각 행의 해당 인덱스 원소를 가져옴
customers.Name.str.split(' ', n=1).str.get(0), customers.Name.str.split(' ', n=1).str.get(-1)
# -1 : 마지막 인덱스

(0           Frank
 1       Elizabeth
 2          Donald
 3         Michael
 4         Jasmine
           ...
 9956         Dana
 9957       Amanda
 9958         Eric
 9959       Taylor
 9960       Sherry
 Name: Name, Length: 9961, dtype: object,
 0           Manning
 1           Johnson
 2          Stephens
 3       Vincent III
 4            Zamora
            ...
 9956       Browning
 9957       Anderson
 9958          Davis
 9959      Hernandez
 9960      Nicholson
 Name: Name, Length: 9961, dtype: object)

In [103]:
# expand= : 각 행을 Series 로 뽑아주는 파라미터
# n을 제한하지 않으면 없는 칸에 None 넣음

customers.Name.str.split(' ', n=1, expand=True)

              0            1
0         Frank      Manning
1     Elizabeth      Johnson
2        Donald     Stephens
3       Michael  Vincent III
4       Jasmine       Zamora
...         ...          ...
9956       Dana     Browning
9957     Amanda     Anderson
9958       Eric        Davis
9959     Taylor    Hernandez
9960     Sherry    Nicholson

[9961 rows x 2 columns]

In [104]:
# 새 열에 성, 이름 넣기
customers[["First Name", "Last Name"]] = customers.Name.str.split(' ', n=1, expand=True)

In [105]:
# 기존 이름 지우기
customers = customers.drop(labels='Name', axis='columns')
customers

,Address,First Name,Last Name
0,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...
9956,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

### 6.6 코딩 첼린지
- 고객 데이터셋에는 주소 열이 있다.
- 각 주소는 도로, 시, 주 및 우편번호로 구성
- 네 가지 값을 분리하고 각 값을 각각 Street, City, State, Zip 이라는 새 열에 할당
- 기존의 Address 열을 삭제

In [107]:
# 앞의 파일을 그대로 사용
customers.Address

0       6461 Quinn Groves, East Matthew, New Hampshire...
1       1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2       19120 Fleming Manors, Prestonstad, Montana, 23495
3            441 Olivia Creek, Jimmymouth, Georgia, 82991
4       4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...
                              ...
9956    762 Andrew Views Apt. 254, North Paul, New Mex...
9957    44188 Day Crest Apt. 901, Lake Marcia, Maine, ...
9958    73015 Michelle Squares, Watsonville, West Virg...
9959         129 Keith Greens, Haleyfurt, Oklahoma, 98916
9960     355 Griffin Valley, Davidtown, New Mexico, 17581
Name: Address, Length: 9961, dtype: object

In [111]:
# 쉼표 구분, 확장
customers.Address.str.split(', ', n=4, expand=True)

                               0             1              2      3
0              6461 Quinn Groves  East Matthew  New Hampshire  16656
1     1360 Tracey Ports Apt. 419      Kyleport        Vermont  31924
2           19120 Fleming Manors   Prestonstad        Montana  23495
3               441 Olivia Creek    Jimmymouth        Georgia  82991
4     4246 Chelsey Ford Apt. 310     Karamouth           Utah  76252
...                          ...           ...            ...    ...
9956   762 Andrew Views Apt. 254    North Paul     New Mexico  28889
9957    44188 Day Crest Apt. 901   Lake Marcia          Maine  37378
9958      73015 Michelle Squares   Watsonville  West Virginia  03933
9959            129 Keith Greens     Haleyfurt       Oklahoma  98916
9960          355 Griffin Valley     Davidtown     New Mexico  17581

[9961 rows x 4 columns]

In [118]:
# 컬럼 지정
customers[["Street", "City", "State", "Zip"]] = customers.Address.str.split(', ', n=4, expand=True)
customers

,Address,First Name,Last Name,Street,City,State,Zip
0,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252
...,...,...,...,...,...,...,...
9956,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
9957,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
9958,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
9959,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
9960,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581

In [120]:
# 기존 주소 삭제
customers.drop(labels='Address', axis='columns')


# del customers["Address"]  => 이거도 가능

,First Name,Last Name,Street,City,State,Zip
0,Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252
...,...,...,...,...,...,...
9956,Dana,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
9957,Amanda,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
9958,Eric,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
9959,Taylor,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
9960,Sherry,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581

In [ ]:
# Fin.